nxp-mcuxpresso/mcux-sdk-examples/evkbmimxrt1170/coex_examples/coex_wpa_supplicant/cm7/pin_mux.h
/* GPIO_AD_03 (coord P15), SIM1_SVEN/J57[2]/Flash_RST/U21[B2]/J25[9]/J10[8] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_SIM1_SVEN_PERIPHERAL                   LPUART7   /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_SIM1_SVEN_SIGNAL                         RTS_B   /*!< Signal name */

/* GPIO_AD_00 (coord N12), SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_SIM1_TRXD_PERIPHERAL                   LPUART7   /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_SIM1_TRXD_SIGNAL                           TXD   /*!< Signal name */

/* GPIO_AD_01 (coord R14), SIM1_CLK/J44[C3]/J57[7]/CTP_RST_B/J48[28]/J10[4]/J25[13] */
/* Routed pin properties */
#define BOARD_INITARDUINOUARTPINS_SIM1_CLK_PERIPHERAL                    LPUART7   /*!< Peripheral name */
#define BOARD_INITARDUINOUARTPINS_SIM1_CLK_SIGNAL                            RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitArduinoUARTPins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_05 (coord E14), FlexSPI_A_DQS/U21[C3] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_DQS_PERIPHERAL                      FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_DQS_SIGNAL                     FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FlexSPI_A_SS0/U23[1]/U21[C2] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_SS0_PERIPHERAL                      FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_SS0_SIGNAL                   FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B2_07 (coord G14), FlexSPI_A_CLK/U23[6]/U21[B2] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_CLK_PERIPHERAL                      FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_CLK_SIGNAL                    FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B2_08 (coord F15), FlexSPI_A_D0/U23[5]/U21[D3] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_D0_PERIPHERAL                       FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_D0_SIGNAL                    FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B2_09 (coord H15), FlexSPI_A_D1/U23[2]/U21[D2] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_D1_PERIPHERAL                       FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_D1_SIGNAL                    FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B2_10 (coord H14), FlexSPI_A_D2/U23[3]/U21[C4] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_D2_PERIPHERAL                       FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_D2_SIGNAL                    FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B2_11 (coord F16), FlexSPI_A_D3/U23[7]/U21[D4] */
/* Routed pin properties */
#define BOARD_INITSPIPINS_FlexSPI_A_D3_PERIPHERAL                       FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITSPIPINS_FlexSPI_A_D3_SIGNAL                    FLEXSPI_A_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_12 (coord B6), RGMII1_PHY_INTB/U10[31]/BT_UART_CTS/U355[19]/J9[6] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_GPIO_DISP_B2_12_PERIPHERAL                  LPUART2   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_GPIO_DISP_B2_12_SIGNAL                        CTS_B   /*!< Signal name */

/* GPIO_DISP_B2_13 (coord A5), INT1_COMBO/BT_UART_RTS/U354[5]/ETHPHY_RST_B/U10[12] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_BT_UART_RTS_PERIPHERAL                      LPUART2   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_BT_UART_RTS_SIGNAL                            RTS_B   /*!< Signal name */

/* GPIO_DISP_B2_10 (coord D9), LPUART2_TXD/BT_UART_TXD/U354[4]/J25[3]/J9[4] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_BT_UART_TXD_PERIPHERAL                      LPUART2   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_BT_UART_TXD_SIGNAL                              TXD   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord A6), LPUART2_RXD/BT_UART_RXD/U355[20]/J9[2] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_BT_UART_RXD_PERIPHERAL                      LPUART2   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_BT_UART_RXD_SIGNAL                              RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2UARTPins(void);              /* Function assigned for the Cortex-M7F */

#define BOARD_INITM2WIFIRESETPINS_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x8000U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_AD_16 (coord N17), SPDIF_OUT/WIFI_RST_B/U354[3] */
/* Routed pin properties */
#define BOARD_INITM2WIFIRESETPINS_SPDIF_OUT_PERIPHERAL                 CM7_GPIO3   /*!< Peripheral name */
#define BOARD_INITM2WIFIRESETPINS_SPDIF_OUT_SIGNAL               gpio_mux_io_cm7   /*!< Signal name */
#define BOARD_INITM2WIFIRESETPINS_SPDIF_OUT_CHANNEL                          15U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2WifiResetPins(void);         /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B2_17 (coord T2), SEMC_DM3/U25[39] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_DM3_PERIPHERAL                             SAI3   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_DM3_SIGNAL                             sai_mclk   /*!< Signal name */

/* GPIO_EMC_B2_14 (coord M4), SEMC_D29/U25[50] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_D29_PERIPHERAL                             SAI3   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_D29_SIGNAL                          sai_tx_data   /*!< Signal name */

/* GPIO_EMC_B2_13 (coord K5), SEMC_D28/U25[48]/BT_PCM_TXD */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_D28_PERIPHERAL                             SAI3   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_D28_SIGNAL                          sai_rx_data   /*!< Signal name */

