nxp-mcuxpresso/mcux-sdk-examples/evkbmimxrt1170/coex_examples/coex_wpa_supplicant/cm7/pin_mux.h
/* GPIO_EMC_B2_15 (coord L2), SEMC_D30/U25[51]/BT_PCM_BCLK */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_D30_PERIPHERAL                             SAI3   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_D30_SIGNAL                          sai_tx_bclk   /*!< Signal name */

/* GPIO_EMC_B2_16 (coord P2), SEMC_D31/U25[53]/BT_PCM_SYNC */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_D31_PERIPHERAL                             SAI3   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_D31_SIGNAL                          sai_tx_sync   /*!< Signal name */

/* GPIO_LPSR_05 (coord N8), I2C5_SCL/J48[27]/U368[F1]/U115[5]/J10[20]/J84[11A]/J84[11B] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_I2C5_SCL_PERIPHERAL                           LPI2C5   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_I2C5_SCL_SIGNAL                                  SCL   /*!< Signal name */

/* GPIO_LPSR_04 (coord N7), I2C5_SDA/J48[26]/U368[E2]/U115[4]/J10[18]/J84[12A]/J84[12B] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_I2C5_SDA_PERIPHERAL                           LPI2C5   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_I2C5_SDA_SIGNAL                                  SDA   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2ScoPins(void);               /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_05 (coord N8), I2C5_SCL/J48[27]/U368[F1]/U115[5]/J10[20]/J84[11A]/J84[11B] */
/* Routed pin properties */
#define BOARD_INITM2CODECPINS_I2C5_SCL_PERIPHERAL                         LPI2C5   /*!< Peripheral name */
#define BOARD_INITM2CODECPINS_I2C5_SCL_SIGNAL                                SCL   /*!< Signal name */

/* GPIO_LPSR_04 (coord N7), I2C5_SDA/J48[26]/U368[E2]/U115[4]/J10[18]/J84[12A]/J84[12B] */
/* Routed pin properties */
#define BOARD_INITM2CODECPINS_I2C5_SDA_PERIPHERAL                         LPI2C5   /*!< Peripheral name */
#define BOARD_INITM2CODECPINS_I2C5_SDA_SIGNAL                                SDA   /*!< Signal name */

/* GPIO_AD_21 (coord K14), SAI1_TXD[0]/J62[1]/U354[6] */
/* Routed pin properties */
#define BOARD_INITM2CODECPINS_BT_PCM_TXD_PERIPHERAL                         SAI1   /*!< Peripheral name */
#define BOARD_INITM2CODECPINS_BT_PCM_TXD_SIGNAL                    sai_tx_data00   /*!< Signal name */

/* GPIO_AD_22 (coord K12), SAI1_TX_BCLK/U368[E1]/BT_PCM_BCLK/U354[7]/U355[17] */
/* Routed pin properties */
#define BOARD_INITM2CODECPINS_BT_PCM_BCLK_PERIPHERAL                        SAI1   /*!< Peripheral name */
#define BOARD_INITM2CODECPINS_BT_PCM_BCLK_SIGNAL                     sai_tx_bclk   /*!< Signal name */

/* GPIO_AD_23 (coord J12), SAI1_TX_SYNC/U368[D3]/BT_PCM_SYNC/U354[8]/U355[16] */
/* Routed pin properties */
#define BOARD_INITM2CODECPINS_BT_PCM_SYNC_PERIPHERAL                        SAI1   /*!< Peripheral name */
#define BOARD_INITM2CODECPINS_BT_PCM_SYNC_SIGNAL                     sai_tx_sync   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2CodecPins(void);             /* Function assigned for the Cortex-M7F */

/* GPIO_AD_16 (coord N17), SPDIF_OUT/WIFI_RST_B/U354[3] */
/* Routed pin properties */
#define BOARD_INITPINSM2_SPDIF_OUT_PERIPHERAL                              GPIO9   /*!< Peripheral name */
#define BOARD_INITPINSM2_SPDIF_OUT_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_SPDIF_OUT_CHANNEL                                   15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SPDIF_OUT_GPIO                                    GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SPDIF_OUT_GPIO_PIN                                  15U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_SPDIF_OUT_GPIO_PIN_MASK                     (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_31 (coord J17), LPSPI1_SDI/U27[2]/J10[10]/WDOG1_RESET_B_DEB */
/* Routed pin properties */
#define BOARD_INITPINSM2_LPSPI1_SDI_PERIPHERAL                             GPIO9   /*!< Peripheral name */
#define BOARD_INITPINSM2_LPSPI1_SDI_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_LPSPI1_SDI_CHANNEL                                  30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_LPSPI1_SDI_GPIO                                   GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_LPSPI1_SDI_GPIO_PIN                                 30U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_LPSPI1_SDI_GPIO_PIN_MASK                    (1U << 30U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnet1GPins(void);

/* GPIO_AD_16 (coord N17), SDIO_RST */
/* Routed pin properties */
#define BOARD_INITPINSM2_SDIO_RST_PERIPHERAL                               GPIO9   /*!< Peripheral name */
#define BOARD_INITPINSM2_SDIO_RST_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_SDIO_RST_CHANNEL                                    15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SDIO_RST_GPIO                                     GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN                                   15U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN_MASK                      (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_31 (coord J17), WL_RST */
/* Routed pin properties */
#define BOARD_INITPINSM2_WL_RST_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINSM2_WL_RST_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_WL_RST_CHANNEL                                      30U   /*!< Signal channel */

